import pandas as пиздос

def сравни_эту_хуету(логин, пароль):
    """
    для конченой авторизации
    возвращает нахуй словарь с 
    {   
    "значение": "норм"/"хуйня",
    "права": "админ"/"не админ"
    }
    """

    ссылка_в_Тюмень = "https://docs.google.com/spreadsheets/d/1qJ3veQPbXTwN21M7Ovl9ITWzkk5zaSJAVoB1_5FxfLw/edit?usp=sharing"
    датафрейм = пиздос.read_html(ссылка_в_Тюмень, encoding='utf-8')

    логины = датафрейм[0]["A"]
    пароли = датафрейм[0]["B"]
    права = датафрейм[0]["C"]

    сталин = датафрейм[0][["A", "B"]].dropna()
    # print(сталин)

    
    логин_сталин = сталин["A"][0] ## там бля 
    пароль_сталин = сталин["B"][0]



    print(len(сталин["A"]))
    print(сталин["A"][0])

    for i in range(2, len(сталин["A"])):## о бля
        лог = сталин["A"][i]
        пар = сталин["B"][i]

        # print(лог, логин_сталин)
        # print(type(лог), type(логин_сталин))

        if(лог < логин_сталин or (лог == логин_сталин and пароль_сталин < сталин["B"][i - 1])):
            сталин = сталин.drop(index = i)  ## то бля
            i = i-1
            if i < 0:
                i = 0
            # print(сталин)
            
        логин_сталин = лог
        пароль_сталин = пар
    
    # print(сталин)


    индекс = -1
    for и in range(0, len(логины)):
        if логины[и] == логин:
            индекс = и
            break
    
    if индекс == -1:
        return {
            "значение": "хуйня",
            "права": "хуйня"
        }
    else:
        if пароли[индекс] == пароль:
            return {
            "значение": "норм",
            "права": f"{права[индекс]}"
            }
        else:
            return {
            "значение": "хуйня",
            "права": "хуйня"
            }

# ссылка_в_Тюмень = "https://docs.google.com/spreadsheets/d/1qJ3veQPbXTwN21M7Ovl9ITWzkk5zaSJAVoB1_5FxfLw/edit?usp=sharing"
# датафрейм = пиздос.read_html(ссылка_в_Тюмень, encoding='utf-8')

# логины = датафрейм[0]["A"]
# пароли = датафрейм[0]["B"]
# права = датафрейм[0]["C"]

тест = сравни_эту_хуету("Тест", "хуй")
print(тест)

